Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/retirement/retiring_from_work_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: For many of us, the prospect of retirement from work provides an opportunity to seek fresh directions and new challenges
ga: Do mhórán againn, nuair a smaoinímid ar scor ó obair, feicimid deis le treonna nua a ghlacadh nó dúshláin nua a thabhairt

source: You may, for example, be thinking of taking up a different area of paid or voluntary work, learning some new skills, embarking on some travel or just spending more time on a favourite hobby or pastime
ga: Mar shampla, d'fhéadfá a bheith ag smaoineamh ar obair dhifriúil íoctha nó dheonach a dhéanamh, scileanna nua a fhoghlaim, dul ag taisteal nó níos mó ama a chaitheamh ar do rogha caitheamh aimsire

source: Planning for your retirement will give you the best chance of maximising your time, adjusting to this lifestyle change and help you budget for the type of financial security you would like during retirement
ga: Má dhéanann tú pleanáil don scor, tabharfaidh sé an seans is fearr duit tairbhe a bhaint as do chuid ama, dul i dtaithí ar an athrú saoil sin agus cabhróidh sé leat do chuid airgid a bhuiséadú do do rogha slandála airgeadais i rith an scoir

source: People today are living longer, healthier lives so it's important to plan in advance for this new phase in life
ga: Tá daoine an lae inniu ag maireachtáil níos faide agus tá siad níos sláintiúla agus mar sin tá sé tábhachtach pleanáil roimh ré don chéim nua sin sa saol

source: For most of us, the move from work to retirement takes place on a specified date and is not negotiable
ga: Den chuid is mó, tarlaíonn an t-athrú ó fhostaíocht chuig scor ar dháta sonraithe agus níl an dáta sin inchaibidle

source: In other words, you retire from work when you reach a particular age or another date that is set out in your contract of employment
ga: I bhfocail eile, tá sé de cheart agat dul ar scor ó do chuid oibre chomh luath agus a shroicheann tú aois áirithe nó ar dháta eile atá leagtha síos i do chonradh fostaíochta

source: Other people may be in a position to gradually ease into retirement by reducing their workload or doing part-time work
ga: Tá sé de rogha ag daoine áirithe dul ar scor de réir a chéile mar is féidir leo a n-ualach oibre a laghdú nó obair pháirtaimseartha a dhéanamh

source: The following information outlines the various issues that may arise as you make the change from work to retirement and provides information that may help you to make a smooth transition
ga: San eolas seo a leanas, léirítear na saincheisteanna éagsúla a d'fhéadfadh a bheith ann agus tú ag athrú ó fhostaíocht chuig scor agus cuirtear eolas ar fáil le cabhrú leat athrú éasca a dhéanamh

source: A number of organisations throughout the country provide pre-retirement courses which may help you to prepare for retirement
ga: Soláthraíonn roinnt eagraíochtaí trasna na tíre cúrsaí réamhscoir a d'fhéadfadh cabhrú leat ullmhú don scor

source: Active retirement is a concept while has become increasingly popular in Ireland and there are a range of active retirement organisations which promote education and leisure activities for retired people
ga: Is coincheap é scor gníomhach atá ag dul i dtreise in Éirinnagus tá réimse eagraíochtaí ann a chuireann oideachas agus gníomhaíochtaí fóillíochta chun cinn i measc daoine atá scortha. Léigh faoi scor gníomhach anseo

source: Some retired people may simply have retired from one occupation
ga: I gcás daoine áirithe, d'fhéadfadh sé nach mbeidís ach éirithe as gairm amháin

source: For that reason, you may regard retirement as a job change rather than a total withdrawal from the labour market
ga: Mar gheall air sin, d'fhéadfadh sé go mbreathnófá ar an scor mar athrú fostaíochta seachas cúlú iomlán ón bhfórsa oibre

source: Retiring from work therefore may simply signal a career change
ga: Mar sin, b'fhéidir gurbh ionann an scor ó obair agus athrú gairme

source: Most legislation dealing with the protection of employees in Ireland does not have an upper age limit
ga: Ní thugann formhór na reachtaíochta uasteorainn aoise agus é ag plé le cosaint fostaithe in Éirinn

source: This means that if you are working in retirement, then you have the same employment rights as everyone else
ga: Ciallaíonn sé sin go bhfuil na cearta fostaíochta céanna agat le gach duine eile atá ag obair in Éirinn

source: If you decide to work part-time, you can find out about employment rights of part-time workers
ga: Má dhéanann tú an cinneadh dul ag obair go páirtaimseartha, tugtar cur síos ar do chearta i gcearta fostaíochta d'fhostaithe páirtaimseartha

source: There is no single retirement age in Ireland, although 65 is generally regarded as the age most people retire at
ga: Níl aon aois scoir ar leith inÉirinn, cé gurb í 65 an aois is comónta don scor

source: There are upper age limits that restrict entry for various activities, such as entry to some professions
ga: Tá uasteorainneacha aoise ann a chuireann srian ar rochtain ar ghníomhaíochtaí éagsúla, ar nós iontrála do ghairmeacha éagsúla

source: Most contracts of employment have a mandatory retirement age - the age at which you must retire
ga: Tá aois scoir éigeantach luaite i bhformhór na gconarthaí fostaíochta - an aois ag a gcaithfidh tú dul ar scor

source: The usual retirement age in contracts of employment is 65
ga: Is í an ghnáthaois scoir i gconarthaí fostaíochta ná 65

source: Many employment contracts, however, make provision for early retirement from age 60, (or in some cases, from age 55)
ga: Is iomaí conradh fostaíochta, áfach, a dhéanann foráil do luathscor ó 60 bliain d'aois, (nó i gcásanna áirithe ó 55 bliana d'aois)

source: Most also make provision for early retirement on health grounds
ga: Déanann an formhór foráil do luathscor mar thoradh ar shláinte

source: The Employment Equality Acts provide for age equality in employment but they do not prevent the setting of different ages for retirement
ga: Déanann na hAchtanna um Chomhionanas Fostaíochta foráil do chomhionannas aoise san fhostaíocht ach ní chuireann siad cosc ar aoiseanna éagsúla a shocrú i gcomhair scoir

source: If you opt for early retirement, you may need to take various steps to ensure that you maintain your entitlement to social welfare pensions
ga: Más mian leat dul ar luathscor, b'fhéidir go mbeidh ort tabhairt faoi chéimeanna éagsúla le do theidlíocht chuig pinsin leasa shóisialaigh a choinneáil

source: Income supports while retired
ga: Tacaíocht ioncaim agus tú ar scor

source: Before you decide to retire from work, you may need to know what income supports are available
ga: Sula ndéanann tú an cinneadh dul ar scor ó fhostaíocht, seans go mbeidh eolas ag teastáil uait faoi thacaíocht ioncaim atá ar fáil

source: If you are taking early retirement, you may consider yourself unemployed rather than retired and you may need information on benefits for unemployed people
ga: Má théann tú ar scor go luath, b'fhéidir go measfaidh tú go bhfuil tú dífhostaithe in ionad a bheith ar scor agus b'fhéidir go mbeidh eolas ag teastáil uait ar shochair do dhaoine dífhostaithe

source: If you are made redundant you may be entitled to a statutory redundancy lump sum
ga: Má tugadh iomarcaíocht duit féadann tú a bheith i dteideal cnapshuim iomarcaíochta faoi reachtaíocht a fháil

source: If you retire early, for whatever reason, you may be entitled to Jobseeker’s Benefit and subsequently, to Jobseeker’s Allowance
ga: Má théann tú ar scor go luath, cuma cén chúis, b'fhéidir go gcáileoidh tú le haghaidh Sochair Cuardaitheora Poist agus ina dhiaidh sin, le haghaidh Liúntais Cuardaitheora Poist

source: You may also be eligible for a range of back to work and back to education schemes
ga: Féadann tú a bheith i dteideal réimse scéimeanna le filleadh ar obair agus filleadh ar an oideachas

source: There are various types of pension available
ga: Tá cineálacha éagsúla pinsin ar fáil

source: You may have contributed to a pension scheme during your working life, in which case you will get an occupational pension or have a personal pension arrangement
ga: Má rinne tú ranníocaíochtaí chuig scéim phinsin i rith do shaoil oibre gheobhaidh tú pinsean ceirde nó beidh socrú pinsin phearsanta agat

source: You need to deal directly with the pension provider to find out exactly what benefits your pension gives you
ga: Caithfidh tú déileáil go díreach leis an soláthraí pinsin le fáil amach céard iad na sochair atá ag dul le do phinsean

source: If you made sufficient PRSI contributions during your working life, at age 66 you may be entitled to the State Pension (Contributory)
ga: Má rinne tú go leor ranníocaíochtaí ÁSPC i rith do bhlianta oibre, ag aois 66 d'fhéadfá a bheith i dteideal an Pinsean Stáit (Ranníocach) a fháil

source: If you have not made sufficient PRSI contributions, you can apply for a State Pension (Non-Contributory), which is means-tested
ga: Mura ndearna tú go leor ranníocaíochtaí ÁSPC, is féidir leat iarratas a dhéanamh arPhinsean Stáit (Neamh-ranníocach) agus déantar tásáil acmhainne air sin

source: You may also be entitled to Free Travel and to the Household Benefits Package
ga: D'fhéadfá a bheith i dteideal Saorthaisteal agus an Pacáiste Sochar Teaghlaigh a fháil

source: You may need to find out about how lump sum compensation payments are taxed
ga: D'fhéadfadh sé go mbeadh eolas uait maidir le gearradh cánach ar chnapshuimeanna íocaíochtaí cúitimh

source: There are some special tax arrangements for people aged 65 or over
ga: Tá roinnt socruithe cánach speisialta do dhaoine atá 65 bliain d'aois nó níos sine ná sin

source: You may also need to find out how pensions are taxed
ga: D'fhéadfadh sé go mbeadh eolas uait maidir le gearradh cánach ar phinsin

source: Retiring to Ireland from abroad
ga: Teacht ar scor go hÉirinnó thír thar lear

source: Every year, many people choose to retire in Ireland
ga: Gach bliain, tagann daoine ar scor go hÉirinn

source: If you are considering this option, you can find out about moving to Ireland
ga: Má tá tú ag smaoineamh ar an rogha seo a dhéanamh, b'fhéidir gur mhaith leat ár sliocht ar bhogadh go hÉirinn a léamh

source: Legal issues and older people
ga: Saincheisteanna dlíthiúla agus seanóirí

source: It's easy to postpone thinking about what will happen when you get older or if you become unable to manage your own financial and legal affairs
ga: Tá sé tábhachtach, áfach, do dhuine ar bith ag aois ar bith breathnú ar na saincheisteanna seo

source: However, it is important for anyone at any age to consider these issues
ga: Léigh níos mó faoi shocruithe dlí i gcás duine atá míchumasaithe anseo

source: There are legal arrangements in the event of incapacity and you can find out about making a will and power of attorney
ga: Is féidir níos mó a léamh faoi uacht a dhéanamh agus cumhacht aturnae anseo
